# DivisionContainsNoReferences Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..DivisionContainsNoReferences Property
BuiltInFailures..::..DPartFailures Class See Also
---
The division contains no dividing references.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DivisionContainsNoReferences { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivisionContainsNoReferences As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DivisionContainsNoReferences {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace